In [5]:
#IMPORTS
import mysql.connector as sql
import pandas as pd

In [6]:
#CREATE CONNECTION
db_connection = sql.connect(host='localhost', database='pandas-db', user='root', password='')

In [7]:
#SET CURSOR TO THAT DATABASE
db_cursor = db_connection.cursor()

In [8]:
#Using SQL Query to convert to a dataframe
df = pd.read_sql('SELECT * FROM datascience', con=db_connection)

In [9]:
df

   Serial    Name       Job  Age
0       1  Nayeem  Engineer   24
1       3   Afrin   Student   14
2       4  Shanta    Doctor   50
3       5   Munir   Service   56

In [10]:
#Save to a csv file
df.to_csv('db-table-datascience.csv')

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Serial  4 non-null      int64
 1   Name    4 non-null      object
 2   Job     4 non-null      object
 3   Age     4 non-null      int64
dtypes: int64(2), object(2)
memory usage: 256.0+ bytes

In [13]:
#Edit dataframe
df['Height(m)'] = [1.9,1.65,1.6,1.75]

In [14]:
df

   Serial    Name       Job  Age  Height(m)
0       1  Nayeem  Engineer   24       1.90
1       3   Afrin   Student   14       1.65
2       4  Shanta    Doctor   50       1.60
3       5   Munir   Service   56       1.75

In [20]:
#TO MYSQL Database
#Meanwhile it can be converted to a csv and then imported via the phpmysqladmin
#Requires more research
df.to_sql(con=db_connection, name='datascience2', if_exists='replace')